rf-eng/micropython/ports/stm32/machine_i2s.c
/*
 * This file is part of the Micro Python project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014 Damien P. George
 * Copyright (c) 2015 Bryan Morrissey
 * Copyright (c) 2020 Mike Teachman
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <string.h>
#include <errno.h>
#include "py/nlr.h"
#include "py/runtime.h"
#include "py/gc.h"
#include "py/objstr.h"
#include "py/objlist.h"
#include "py/mphal.h"
#include "irq.h"
#include "pin.h"
#include "genhdr/pins.h"
#include "dma.h"
#include "bufhelper.h"
#include "modmachine.h"
#include "led.h" // For debugging using led_toggle(n)

// Pyboard V1.0/V1.1:   Two standard I2S interfaces (multiplexed with SPI2 and SPI3) are available
// Pyboard D SF2W, SF3W:  Three standard I2S interfaces (multiplexed with SPI1, SPI2 and SPI3) are available

// add "how it works" section:  TODO
// describe: 
// - queues, active buffer
// - circular mode for continuous streaming
// - asynchronous design
// - call back
// - use of STM32 HAL API
// - ?


// STM32 HAL API does not implement a MONO channel format TODO  finish describing this ...

// TODO implement TVE suggestions

// 1. "id" versus "port"  TODO:  update following for STM platform
//    The MicroPython API identifies instances of a peripheral using "id", while the ESP-IDF uses "port".
//    - for example, the first I2S peripheral on the ESP32 would be indicated by id=0 in MicroPython
//      and port=0 in ESP-IDF
// 2. any C type, macro, or function prefaced by "i2s" is associated with an ESP-IDF I2S interface definition
// 3. any C type, macro, or function prefaced by "machine_i2s" is associated with the MicroPython implementation of I2S

// \moduleref pyb
// \class I2S - Inter-IC-Sound, a protocol to transfer isochronous audio data
//
// I2S is a serial protocol for sending and receiving audio. This implementation
// uses three physical lines: Bit Clock, Word Select, and Data

// Possible DMA configurations for I2S busses:

// TODO add F7 processor for SP1
// SPI2 RX:     DMA1_Stream3.CHANNEL_0
// SPI2 TX:     DMA1_Stream4.CHANNEL_0
// SPI3 RX:     DMA1_Stream0.CHANNEL_0 or DMA1_Stream2.CHANNEL_0
// SPI3 TX:     DMA1_Stream5.CHANNEL_0 or DMA1_Stream7.CHANNEL_0

#define MEASURE_COPY_PERFORMANCE 1

#define SIZEOF_DMA_BUFFER_IN_BYTES (256)  // TODO what is the minimal size for acceptable performance
#define QUEUE_CAPACITY (10)

typedef enum {
    TOP_HALF    = 0,
    BOTTOM_HALF = 1,
} machine_i2s_dma_buffer_ping_pong_t;  // TODO crazy long name

typedef enum {
    MONO   = 0,
    STEREO = 1,
} machine_i2s_format_t;

typedef struct _machine_i2s_queue_t {
    mp_obj_t                buffers[QUEUE_CAPACITY];
    int16_t                 head;
    int16_t                 tail;
    int16_t                 size; // TODO is this needed?
} machine_i2s_queue_t;

typedef struct _machine_i2s_obj_t {
    mp_obj_base_t           base;
    mp_int_t                i2s_id;
    I2S_HandleTypeDef       i2s;
    const dma_descr_t       *tx_dma_descr;
    const dma_descr_t       *rx_dma_descr; 
    DMA_HandleTypeDef       tx_dma;
    DMA_HandleTypeDef       rx_dma;
    mp_obj_t                callback;
    mp_obj_t                active_buffer;
    uint32_t                active_buffer_index;
    machine_i2s_queue_t     active_queue;
    machine_i2s_queue_t     idle_queue;
    uint8_t                 dma_buffer[SIZEOF_DMA_BUFFER_IN_BYTES];
    pin_obj_t               *sck;
    pin_obj_t               *ws;
    pin_obj_t               *sd;
    uint16_t                mode;
    int8_t                  bits;
    machine_i2s_format_t    format;
    int32_t                 rate;
    bool                    used;
} machine_i2s_obj_t;

// TODO:  is this RAM usage unacceptably massive in uPy???  check sizeof() machine_i2s_obj_t versus the norms ....
// Static object mapping to I2S peripherals
//   note:  I2S implementation makes use of the following mapping between I2S peripheral and I2S object
//      I2S peripheral 1:  machine_i2s_obj[0]
//      I2S peripheral 2:  machine_i2s_obj[1]
STATIC machine_i2s_obj_t machine_i2s_obj[2] = {  //  TODO fix magic number 2  pybv1.1 = 1, pybD = 2
        [0].used = false,
        [1].used = false 
};

//
//  circular queue containing references to MicroPython objects (e.g. bytearray) that hold audio samples
//

STATIC void queueInit(machine_i2s_queue_t *queue) {
    queue->tail = -1;
    queue->head = 0;
    queue->size = 0;
}


// note:  must check queue has room before calling TODO ...thread safe?
// TODO see dequeue() comments
STATIC void enqueue(machine_i2s_queue_t *queue, mp_obj_t item) {
    queue->tail = (queue->tail + 1) % QUEUE_CAPACITY;
    queue->buffers[queue->tail] = item;
    queue->size = queue->size + 1;
}

// note:  must check queue is not empty before calling TODO ...thread safe?
//  TODO return NULL when queue is empty
STATIC mp_obj_t dequeue(machine_i2s_queue_t *queue) {
    mp_obj_t tmp = queue->buffers[queue->head];
    queue->head = (queue->head + 1) % QUEUE_CAPACITY;
    queue->size = queue->size - 1;
    return tmp;
}

STATIC bool isEmpty(machine_i2s_queue_t *queue) {
    return (bool)(queue->size == 0);
}


STATIC bool isFull(machine_i2s_queue_t *queue) {
    return (bool)(queue->size == QUEUE_CAPACITY);
}

//  For 32-bit audio samples, the STM32 HAL API expects each 32-bit sample to be encoded 
//  in an unusual byte ordering:  Byte_2, Byte_3, Byte_0, Byte_1
//      where:  Byte_0 is the least significant byte of the 32-bit sample
//
//  The following function takes a buffer containing 32-bits sample values formatted as little endian 
//  and performs an in-place modification into the STM32 HAL API convention
//
//  Example:
//
//   little_endian[] = [L_0-7,   L_8-15,  L_16-23, L_24-31, R_0-7,   R_8-15,  R_16-23, R_24-31] =  [Left channel, Right channel]           
//   stm_api[] =       [L_16-23, L_24-31, L_0-7,   L_8-15,  R_16-23, R_24-31, R_0-7,   R_8-15] = [Left channel, Right channel]
//
//   where:
//      L_0-7 is the least significant byte of the 32 bit sample in the Left channel 
//      L_24-31 is the most significant byte of the 32 bit sample in the Left channel 
//
//   little_endian[] =  [0x99, 0xBB, 0x11, 0x22, 0x44, 0x55, 0xAB, 0x77] = [Left channel, Right channel]           
//   stm_api[] =        [0x11, 0x22, 0x99, 0xBB, 0xAB, 0x77, 0x44, 0x55] = [Left channel, Right channel]
//
//   where:
//      LEFT Channel =  0x99, 0xBB, 0x11, 0x22
//      RIGHT Channel = 0x44, 0x55, 0xAB, 0x77
STATIC void machine_i2s_reformat_32_bit_samples(int32_t *sample, uint32_t num_samples) {
    int16_t sample_ms;
    int16_t sample_ls;
    for (uint32_t i=0; i<num_samples; i++) {
        sample_ls = sample[i] & 0xFFFF;
        sample_ms = sample[i] >> 16;
        sample[i] = (sample_ls << 16) + sample_ms;
    }
}

// TODO investigate mp_sched_schedule(self->callback, self);
STATIC void i2s_handle_mp_callback(machine_i2s_obj_t *self) {
    if (self->callback != mp_const_none) {
        gc_lock();
        nlr_buf_t nlr;
        if (nlr_push(&nlr) == 0) {
            mp_call_function_1(self->callback, self);
            nlr_pop();
        } else {
            // Uncaught exception; disable the callback so it doesn't run again.
            self->callback = mp_const_none;
            // DMA_HandleTypeDef dma = self->tx_dma;
            // __HAL_DMA_DISABLE(&dma);
            printf("uncaught exception in I2S(%u) DMA interrupt handler\n", self->i2s_id);
            mp_obj_print_exception(&mp_plat_print, (mp_obj_t)nlr.ret_val);
        }
        gc_unlock();
    }
}


// Simplying assumptions:
//   - size of sample buffers is an integer multiple of dma buffer size
//   -  TODO  note:  size of 1/2 dma buffer needs to be a multiple of 8 bytes  (so 1/2 of buffer always
//      contains integer number of complete stereo frames @ 32 bits/sample)
STATIC void machine_i2s_empty_dma(machine_i2s_obj_t *self, machine_i2s_dma_buffer_ping_pong_t dma_ping_pong) {
    
    mp_buffer_info_t bufinfo;
    
    // is a sample buffer actively being filled?
    // if not try to pull one from the idle queue
    
    if (self->active_buffer == NULL) {  // TODO rename idle_buffer ?  
        // try to pull new sample buffer from the queue
        if (!isEmpty(&self->idle_queue)) {
            mp_obj_t sample_buffer = dequeue(&self->idle_queue);
            self->active_buffer = sample_buffer;
            self->active_buffer_index = 0;
        } else {
            // no samples to 
            // TODO (?) fill dma buffer with zeros as there was no sample data to fill it
            // this would produce silence audio when no more sample data is available
            return;
        }
    }
    
