rf-eng/micropython/ports/stm32/machine_i2s.c
    uint16_t dma_buffer_index = 0;
    if (dma_ping_pong == TOP_HALF) {
        dma_buffer_index = 0;  
    } else { // BOTTOM_HALF
        dma_buffer_index = SIZEOF_DMA_BUFFER_IN_BYTES/2; 
    }
    
    // 32 bit samples need to be reformatted to match STM32 HAL API requirements for I2S
    // TODO  SIZEOF_DMA_BUFFER_IN_BYTES/2  <--- make a macro for this
    if (self->bits == I2S_DATAFORMAT_32B) {
        machine_i2s_reformat_32_bit_samples((int32_t *)&self->dma_buffer[dma_buffer_index], SIZEOF_DMA_BUFFER_IN_BYTES/2/4);
    }
    
    // copy a block of samples from the dma buffer to the active buffer.
    // mono format is implemented by duplicating each sample into both L and R channels.
    // (STM32 HAL API has a stereo I2S implementation, but not mono)
    
    mp_get_buffer(self->active_buffer, &bufinfo, MP_BUFFER_WRITE);

    if ((self->format == MONO) && (self->bits == I2S_DATAFORMAT_16B)) {
        uint32_t samples_to_copy = SIZEOF_DMA_BUFFER_IN_BYTES/2/4;  // TODO - really confusing -- fix
        uint16_t *dma_buffer_p = (uint16_t *)&self->dma_buffer[dma_buffer_index];

        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint16_t *active_buffer_p = (uint16_t *)temp2;

        for (uint32_t i=0; i<samples_to_copy; i++) {
            active_buffer_p[i] = dma_buffer_p[i*2]; 
        }
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2/2;  // TODO - really confusing -- fix
        
    } else if ((self->format == MONO) && (self->bits == I2S_DATAFORMAT_32B)) {
        uint32_t samples_to_copy = SIZEOF_DMA_BUFFER_IN_BYTES/2/8;
        uint32_t *dma_buffer_p = (uint32_t *)&self->dma_buffer[dma_buffer_index];
        
        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint32_t *active_buffer_p = (uint32_t *)temp2;
        
        for (uint32_t i=0; i<samples_to_copy; i++) {
            active_buffer_p[i] = dma_buffer_p[i*2]; 
        }
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2/2;
        
    } else { // STEREO, both 16-bit and 32-bit
        memcpy(&((uint8_t *)bufinfo.buf)[self->active_buffer_index],
               &self->dma_buffer[dma_buffer_index], 
               SIZEOF_DMA_BUFFER_IN_BYTES/2);
        
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2;
    }
    
    // has active buffer been filled?
    if (self->active_buffer_index >= bufinfo.len) {
        // clear buffer and push to active queue

        // TODO clear a buffer somewhere (before being put back into idle queue?)
        // memset(bufinfo.buf, 0, bufinfo.len);
        enqueue(&self->active_queue, self->active_buffer);
        self->active_buffer = NULL;
        i2s_handle_mp_callback(self);  // TODO "handle" <-- get better word
    }
}

// Simplying assumptions:
//   - size of sample buffers is an integer multiple of dma buffer size
//   -  TODO  note:  size of 1/2 dma buffer needs to be a multiple of 8 bytes  (so 1/2 of buffer always
//      contains integer number of complete stereo frames @ 32 bits/sample)
STATIC void machine_i2s_feed_dma(machine_i2s_obj_t *self, machine_i2s_dma_buffer_ping_pong_t dma_ping_pong) {
    
    mp_buffer_info_t bufinfo;
    
    // is a sample buffer actively being emptied?
    // if not try to pull one from the active queue
    
    if (self->active_buffer == NULL) {  // TODO rename active_buffer ?  
        // try to pull new sample buffer from the queue
        if (!isEmpty(&self->active_queue)) {  // TODO better name for active_queue?  sample_queue?
            mp_obj_t sample_buffer = dequeue(&self->active_queue);
            self->active_buffer = sample_buffer;
            self->active_buffer_index = 0;
        } else {
            // no samples to 
            // TODO (?) fill dma buffer with zeros as there was no sample data to fill it
            // this would produce silence audio when no more sample data is available
            return;
        }
    }
    
    uint16_t dma_buffer_index = 0;
    if (dma_ping_pong == TOP_HALF) {
        dma_buffer_index = 0;  
    } else { // BOTTOM_HALF
        dma_buffer_index = SIZEOF_DMA_BUFFER_IN_BYTES/2; 
    }
    
    mp_get_buffer(self->active_buffer, &bufinfo, MP_BUFFER_WRITE);
    
    // copy a block of samples from the active buffer to the dma buffer.
    // mono format is implemented by duplicating each sample into both L and R channels.
    // (STM32 HAL API has a stereo I2S implementation, but not mono)
    
    if ((self->format == MONO) && (self->bits == I2S_DATAFORMAT_16B)) {
        uint32_t samples_to_copy = SIZEOF_DMA_BUFFER_IN_BYTES/2/4; // TODO - really confusing -- fix
        uint16_t *dma_buffer_p = (uint16_t *)&self->dma_buffer[dma_buffer_index];

        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint16_t *active_buffer_p = (uint16_t *)temp2;

        for (uint32_t i=0; i<samples_to_copy; i++) {
            dma_buffer_p[i*2] = active_buffer_p[i]; 
            dma_buffer_p[i*2+1] = active_buffer_p[i]; 
        }
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2/2;  // TODO - really confusing -- fix
        
    } else if ((self->format == MONO) && (self->bits == I2S_DATAFORMAT_32B)) {
        uint32_t samples_to_copy = SIZEOF_DMA_BUFFER_IN_BYTES/2/8;
        uint32_t *dma_buffer_p = (uint32_t *)&self->dma_buffer[dma_buffer_index];
        
        uint8_t *temp = (uint8_t *)bufinfo.buf;
        uint8_t *temp2 = &temp[self->active_buffer_index];
        uint32_t *active_buffer_p = (uint32_t *)temp2;
        
        for (uint32_t i=0; i<samples_to_copy; i++) {
            dma_buffer_p[i*2] = active_buffer_p[i]; 
            dma_buffer_p[i*2+1] = active_buffer_p[i]; 
        }
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2/2;
        
    } else { // STEREO, both 16-bit and 32-bit
        memcpy(&self->dma_buffer[dma_buffer_index], 
               &((uint8_t *)bufinfo.buf)[self->active_buffer_index], 
               SIZEOF_DMA_BUFFER_IN_BYTES/2);
        
        self->active_buffer_index += SIZEOF_DMA_BUFFER_IN_BYTES/2;
    }
    
    // 32 bit samples need to be reformatted to match STM32 HAL API requirements for I2S
    // TODO  SIZEOF_DMA_BUFFER_IN_BYTES/2  <--- make a macro for this
    if (self->bits == I2S_DATAFORMAT_32B) {
        machine_i2s_reformat_32_bit_samples((int32_t *)&self->dma_buffer[dma_buffer_index], SIZEOF_DMA_BUFFER_IN_BYTES/2/4);
    }
    
    // has active buffer been emptied?
    if (self->active_buffer_index >= bufinfo.len) {
        // clear buffer and push to idle queue
        memset(bufinfo.buf, 0, bufinfo.len);
        enqueue(&self->idle_queue, self->active_buffer);
        self->active_buffer = NULL;
        i2s_handle_mp_callback(self);  // TODO "handle" <-- get better word
    }
}

