rf-eng/micropython/ports/stm32/machine_i2s.c
#if 0
static void led_flash_error(int colour, int count) {
    for(;;) {
        for (int c=0;c<count;c++) {
            led_state(colour, 1);
            HAL_Delay(300);
            led_state(colour, 0);
            HAL_Delay(300);
        }
        HAL_Delay(2000);
    }
}

static void led_flash_info(int colour, int count) {
    for (int c=0;c<count;c++) {
        led_state(colour, 1);
        HAL_Delay(300);
        led_state(colour, 0);
        HAL_Delay(300);
    }
}
#endif

// assumes init parameters are set up correctly
STATIC bool i2s_init(machine_i2s_obj_t *i2s_obj) {
    // init the GPIO lines
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
    GPIO_InitStructure.Pull = GPIO_PULLUP;

    if (i2s_obj->i2s_id == 1) {  // TODO replace magic number with Macro ... or use spi_find_index()?
        i2s_obj->i2s.Instance = I2S1;
        __SPI1_CLK_ENABLE();
        // configure DMA streams - see RM0090 section 10.3.3, Tables 42 & 43
        // TODO what to do when application tries to configure both I2S and SPI features on SPI1?

        if (i2s_obj->mode == I2S_MODE_MASTER_RX) {
            i2s_obj->rx_dma_descr = &dma_I2S_1_RX;
        } else {
            i2s_obj->tx_dma_descr = &dma_I2S_1_TX;
        }
    } else if (i2s_obj->i2s_id == 2) {
        i2s_obj->i2s.Instance = I2S2;
        __SPI2_CLK_ENABLE();
        // configure DMA streams - see RM0090 section 10.3.3, Tables 42 & 43
        if (i2s_obj->mode == I2S_MODE_MASTER_RX) {
            i2s_obj->rx_dma_descr = &dma_I2S_2_RX;
        } else {
            i2s_obj->tx_dma_descr = &dma_I2S_2_TX;
        }
    } else {
        // invalid i2s_id number; shouldn't get here as i2s object should not
        // have been created without setting a valid i2s instance number
        return false;
    }

    // GPIO Pin initialization
    if (i2s_obj->sck != MP_OBJ_NULL) {
        GPIO_InitStructure.Pin = i2s_obj->sck->pin_mask;
        const pin_af_obj_t *af = pin_find_af(i2s_obj->sck, AF_FN_I2S, i2s_obj->i2s_id);
        assert(af != NULL);  // TODO  assert ???  maybe uPY friendly way to indicate unexpected error?
        // Alt function is set using af->idx instead of GPIO_AFx_I2Sx macros
        GPIO_InitStructure.Alternate = (uint8_t)af->idx;
        HAL_GPIO_Init(i2s_obj->sck->gpio, &GPIO_InitStructure);
    }
    
    if (i2s_obj->ws != MP_OBJ_NULL) {
        GPIO_InitStructure.Pin = i2s_obj->ws->pin_mask;
        const pin_af_obj_t *af = pin_find_af(i2s_obj->ws, AF_FN_I2S, i2s_obj->i2s_id);
        assert(af != NULL);  // TODO  assert ???  maybe uPY friendly way to indicate unexpected error?
        // Alt function is set using af->idx instead of GPIO_AFx_I2Sx macros
        GPIO_InitStructure.Alternate = (uint8_t)af->idx;
        HAL_GPIO_Init(i2s_obj->ws->gpio, &GPIO_InitStructure);
    }
    
    if (i2s_obj->sd != MP_OBJ_NULL) {
        GPIO_InitStructure.Pin = i2s_obj->sd->pin_mask;
        const pin_af_obj_t *af = pin_find_af(i2s_obj->sd, AF_FN_I2S, i2s_obj->i2s_id);
        assert(af != NULL);  // TODO  assert ???  maybe uPY friendly way to indicate unexpected error?
        // Alt function is set using af->idx instead of GPIO_AFx_I2Sx macros
        GPIO_InitStructure.Alternate = (uint8_t)af->idx;
        HAL_GPIO_Init(i2s_obj->sd->gpio, &GPIO_InitStructure);
    }

    // Configure and enable I2SPLL - I2S_MASTER modes only:
    // ====================================================
    // References for STM32F405 (pybv10 and pybv11):
    //    1) table 127 "Audio frequency precision" of RM0090 Reference manual
    //    2) lines 457-494 of STM32Cube_FW_F4_V1.5.0/Drivers/BSP/STM32F4-Discovery/stm32f4_discovery_audio.c
    //
    // References for STM32F722 (PYBD-SF2W) and STM32F723 (PYBD-SF3W)
    //    1) table 204 "Audio-frequency precision" of RM0385 Reference manual
    //
    // References for STM32F767 (PYBD-SF6W)
    //    1) table 229 "Audio-frequency precision" of RM0410 Reference manual

    //    48kHz family is accurate for 8, 16, 24, and 48kHz but not 32 or 96
    //    44.1kHz family is accurate for 11.025, 22.05 and 44.1kHz but not 88.2

    // TODO: support more of the commonly-used frequencies and account for 16/32 bit frames
    // TODO: Refactor to use macros as provided by stm32f4xx_hal_rcc_ex.h
    
#if defined (STM32F405xx)
    // __HAL_RCC_PLLI2S_CONFIG(__PLLI2SN__, __PLLI2SR__)
    __HAL_RCC_PLLI2S_DISABLE();
    if ((i2s_obj->i2s.Init.AudioFreq & 0x7) == 0) {
        __HAL_RCC_PLLI2S_CONFIG(384, 5); // TODO
    } else {
        __HAL_RCC_PLLI2S_CONFIG(429, 4); // TODO
    }
        __HAL_RCC_PLLI2S_ENABLE();
#elif defined (STM32F722xx) || defined (STM32F723xx)
    // __HAL_RCC_PLLI2S_CONFIG(__PLLI2SN__, __PLLI2SQ__, __PLLI2SR__)
    // TODO can PLL config be set "per channel"?
    __HAL_RCC_PLLI2S_DISABLE();
    if ((i2s_obj->i2s.Init.AudioFreq & 0x7) == 0) {
        __HAL_RCC_PLLI2S_CONFIG(384, 1, 5); // TODO
    } else {
        __HAL_RCC_PLLI2S_CONFIG(429, 1, 4); // TODO
    }
        __HAL_RCC_PLLI2S_ENABLE();
#elif defined (STM32F767xx)
#error I2S not yet supported on the STM32F767xx processor (future)
#else
#error I2S does not support this processor
#endif // STM32F405xx

    if (HAL_I2S_Init(&i2s_obj->i2s) == HAL_OK) {
        // Reset and initialize Tx and Rx DMA channels

        if (i2s_obj->mode == I2S_MODE_MASTER_RX) {
            // Reset and initialize rx DMA
            dma_invalidate_channel(i2s_obj->rx_dma_descr);

            dma_init(&i2s_obj->rx_dma, i2s_obj->rx_dma_descr, DMA_PERIPH_TO_MEMORY, &i2s_obj->i2s);
            i2s_obj->i2s.hdmarx = &i2s_obj->rx_dma;
#if 0
            // set I2S Rx DMA interrupt priority
            if (i2s_obj->i2s_id == 1) {
                NVIC_SetPriority(DMA1_Stream3_IRQn, (IRQ_PRI_DMA+1));
                HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
            } else if (i2s_obj->i2s_id == 2) {
                //NVIC_SetPriority(DMA2_Stream3_IRQn, (IRQ_PRI_DMA+1));
                //NVIC_SetPriority(DMA1_Stream3_IRQn, (IRQ_PRI_DMA+1)); // lower DMA priority
                HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);
            } else {
                // invalid i2s_id number; shouldn't get here as i2s object should not
                // have been created without setting a valid i2s instance number
                return false;
            }
#endif
        } else {
            // Reset and initialize tx DMA
            dma_invalidate_channel(i2s_obj->tx_dma_descr);

            dma_init(&i2s_obj->tx_dma, i2s_obj->tx_dma_descr, DMA_MEMORY_TO_PERIPH, &i2s_obj->i2s);
            i2s_obj->i2s.hdmatx = &i2s_obj->tx_dma;

