rf-eng/micropython/ports/stm32/machine_i2s.c
    // set the I2S configuration values
    memset(&self->i2s, 0, sizeof(self->i2s));
    
    queueInit(&self->active_queue);
    queueInit(&self->idle_queue);

    //
    // ---- Check validity of arguments ----
    //

    // are I2S pin assignments valid?
    const pin_af_obj_t *pin_af;

    // is SCK valid?
    if (mp_obj_is_type(args[ARG_sck].u_obj, &pin_type)) {
        pin_af = pin_find_af(args[ARG_sck].u_obj, AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_CK) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("no valid SCK pin for I2S%d"), self->i2s_id);
        }
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SCK not a Pin type"));
    }
    
    // is WS valid?
    if (mp_obj_is_type(args[ARG_ws].u_obj, &pin_type)) {
        pin_af = pin_find_af(args[ARG_ws].u_obj, AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_WS) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("no valid WS pin for I2S%d"), self->i2s_id);
        }
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("WS not a Pin type"));
    }
    
    // is SD valid?
    if (mp_obj_is_type(args[ARG_sd].u_obj, &pin_type)) {
        pin_af = pin_find_af(args[ARG_sd].u_obj, AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_SD) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("no valid SD pin for I2S%d"), self->i2s_id);
        }
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SD not a Pin type"));
    }

    // is Mode valid?
    uint16_t i2s_mode = args[ARG_mode].u_int;
    if ((i2s_mode != (I2S_MODE_MASTER_RX)) &&
        (i2s_mode != (I2S_MODE_MASTER_TX))) {
        mp_raise_ValueError(MP_ERROR_TEXT("Mode is not valid"));
    }
    
    // is Bits valid?
    int8_t i2s_bits_per_sample = -1;
    // TODO add 24 bits -- audio folks will expect to see this
    if (args[ARG_bits].u_int == 16) { i2s_bits_per_sample = I2S_DATAFORMAT_16B; }
    else if (args[ARG_bits].u_int == 32) { i2s_bits_per_sample = I2S_DATAFORMAT_32B; }
    else { 
        mp_raise_ValueError(MP_ERROR_TEXT("Bits is not valid"));
    }
    
    // is Format valid?
    machine_i2s_format_t i2s_format = args[ARG_format].u_int;
    if ((i2s_format != MONO) &&
        (i2s_format != STEREO)) {
        mp_raise_ValueError(MP_ERROR_TEXT("Format is not valid"));
    }

    // is Sample Rate valid?
    // No validation done:  TODO can it be validated?
    
    // are Buffers valid?
    // buffers are contained in a list or tuple
    // check that type is a list or tuple
    if (mp_obj_is_type(args[ARG_buffers].u_obj, &mp_type_tuple) || mp_obj_is_type(args[ARG_buffers].u_obj, &mp_type_list)) {
        mp_uint_t len = 0;
        mp_obj_t *elem;
        mp_obj_get_array(args[ARG_buffers].u_obj, &len, &elem);
        
        if (len > QUEUE_CAPACITY) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("Num buffers exceeded, max is %d"), QUEUE_CAPACITY);
        }
        
        // add buffers to the idle queue
        for (uint16_t i=0; i<len; i++) {
            // check for valid buffer
            mp_buffer_info_t bufinfo;
            mp_get_buffer_raise(elem[i], &bufinfo, MP_BUFFER_RW);
            
            // add buffer to idle queue 
            enqueue(&self->idle_queue, elem[i]);
        }
    } else {
        mp_raise_TypeError(MP_ERROR_TEXT("Buffers must be contained in a list or tuple"));
    }

    // is callback valid?
    //printf("callable = %d\n", mp_obj_is_callable(args[ARG_callback].u_obj));  // TODO test with no callback
    // TODO raise exception if callback is bogus ?
    
    self->sck = args[ARG_sck].u_obj;
    self->ws = args[ARG_ws].u_obj;
    self->sd = args[ARG_sd].u_obj;
    self->mode = i2s_mode;
    self->bits = i2s_bits_per_sample;
    self->format = i2s_format;
    self->rate = args[ARG_rate].u_int;
    self->callback = args[ARG_callback].u_obj;
    
    I2S_InitTypeDef *init = &self->i2s.Init;
    init->Mode = i2s_mode;
    init->Standard   = I2S_STANDARD_PHILIPS;
    init->DataFormat = i2s_bits_per_sample;
    init->MCLKOutput = I2S_MCLKOUTPUT_DISABLE;
    init->AudioFreq  = args[ARG_rate].u_int;
    init->CPOL       = I2S_CPOL_LOW;
    init->ClockSource = I2S_CLOCK_PLL; 
    
    // init the I2S bus
    if (!i2s_init(self)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2S port %d init failed"), self->i2s_id);
    }
    
    self->used = true;
}

/******************************************************************************/
// MicroPython bindings for I2S
STATIC void machine_i2s_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_i2s_obj_t *self = MP_OBJ_TO_PTR(self_in);
    
    qstr mode = 0;
    if (self->mode == I2S_MODE_MASTER_RX) { mode = MP_QSTR_RX; }
    else if (self->mode == I2S_MODE_MASTER_TX) { mode = MP_QSTR_TX; }
    else { /* shouldn't get here */ }
    
    uint8_t bits = 0;
    if (self->bits == I2S_DATAFORMAT_16B) { bits = 16; }
    else if (self->bits == I2S_DATAFORMAT_24B) { mode = 24; }
    else if (self->bits == I2S_DATAFORMAT_32B) { mode = 32; }
    else { /* shouldn't get here */ }
    
    // TODO add self->format
    
    mp_printf(print, "I2S(id=%u, sck=%q, ws=%q, sd=%q\n"
            "mode=%q, bits=%u, rate=%d)\n",
            self->i2s_id, self->sck->name, self->ws->name, self->sd->name,
            mode, bits, self->rate
            );
}

// TODO move all the pin stuff to the start of the file
// Construct an I2S object on the given bus.  `bus` can be 1 or 2.
// I2S requires a clock pin (SCK), a word select pin (WS) and
// a data pin (SD).
//
// Alternate Function (AF) Pin Mappings for I2S on pyboards
//
// Valid pins for I2S on the pyboard, models v1.0, v1.1:
// see alternate function mapping in datasheet
// TODO check pin availability
//     SCK -   B13 / Y6,  PB10 / Y9,       (SPI2 SCK)
//     WS -    B12 / Y5,  PB9  / Y4,       (SPI2 NSS)
//     SD -    B15 / Y8,  PC3  / X22       (SPI2 MOSI)
//   - `SPI(1)` is on the X position: `(NSS, SCK, MISO, MOSI) = (X5, X6, X7, X8) = (PA4, PA5, PA6, PA7)`
//   - `SPI(2)` is on the Y position: `(NSS, SCK, MISO, MOSI) = (Y5, Y6, Y7, Y8) = (PB12, PB13, PB14, PB15)`


//
// Valid pins for I2S on the pyboard D, models SF2W, SF3W:
// see alternate function  mapping in datasheet
// TODO check pin availability on DIP28 and DIP68 boards
//     SCK -   A5  / W6 / X6,  PB3  / --     (SPI1 SCK)
//     WS -    A4  / --,  PA15 / --     (SPI1 NSS)
//     SD -    A7  / --,  PB5  / --     (SPI1 MOSI)
//
//     SCK -   A9  / --,  PB13 / --,  PB10 / --,  PD3 / --  (SPI2 SCK)
//     WS -    PB12 / Y5,  PB9  / --                        (SPI2 NSS)
//     SD -    PB15 / --,  PC3  / --,  PC1 / --,  PC3 / --   (SPI2 MOSI)
//
//     SCK -   PB3  / --,  PC10 / --,   / --,   / --  (SPI3 SCK)
//     WS -    PA4 / ,  PA15  / --                        (SPI3 NSS)
//     SD -    PB5 / --, PC12   / --,   PD6/ --,   / --   (SPI3 MOSI)


//
// The I2S3 port is disabled by default on the pyboard, as its pins would
// conflict with the SD Card and other pyboard functions.
//
STATIC mp_obj_t machine_i2s_make_new(const mp_obj_type_t *type, size_t n_pos_args, size_t n_kw_args, const mp_obj_t *args) {
    mp_arg_check_num(n_pos_args, n_kw_args, 1, MP_OBJ_FUN_ARGS_MAX, true);

    machine_i2s_obj_t *self;
    
    // note: it is safe to assume that the arg pointer below references a positional argument because the arg check above
    //       guarantees that at least one positional argument has been provided
    uint8_t i2s_id = mp_obj_get_int(args[0]);  // TODO i2s_id has values 1,2,3 for STM32 ...different than ESP32 e.g.  0,1
    if (i2s_id == 1) { // TODO fix magic number 
        self = &machine_i2s_obj[0];
    } else if (i2s_id == 2) { // TODO fix magic number 
        self = &machine_i2s_obj[1];
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("I2S ID is not valid"));
    }

    self->base.type = &machine_i2s_type;
    self->i2s_id = i2s_id;

    // is I2S peripheral already in use?
    if (self->used) {
        mp_raise_ValueError(MP_ERROR_TEXT("I2S port is already in use"));
    }

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw_args, args + n_pos_args);
    // note:  "args + 1" below has the effect of skipping over the ID argument
    machine_i2s_init_helper(self, n_pos_args - 1, args + 1, &kw_args);

