rf-eng/micropython/ports/stm32/machine_i2s.c
    return MP_OBJ_FROM_PTR(self);
}

STATIC mp_obj_t machine_i2s_init(mp_uint_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    // note:  "pos_args + 1" below has the effect of skipping over "self"
    machine_i2s_init_helper(pos_args[0], n_pos_args - 1, pos_args + 1, kw_args);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_i2s_init_obj, 1, machine_i2s_init);

// TODO is returning None "pythonic" when no buffer is available?
STATIC mp_obj_t machine_i2s_getbuffer(mp_obj_t self_in) {
    machine_i2s_obj_t *self = self_in;

    if (!self->used) {
        mp_raise_ValueError(MP_ERROR_TEXT("I2S port is not initialized")); // TODO needed?
    }
    
    //if (self->mode != I2S_MODE_MASTER_TX) {
    //    mp_raise_ValueError(MP_ERROR_TEXT("I2S not configured for write method"));
    //}
    
    // For TX mode, remove from idle queue. For RX mode, add to active queue 
    if (self->mode == I2S_MODE_MASTER_TX) {
        // remove from idle queue 
        // TODO change way of doing this ... try to remove with dequeue(), then test for true/false ...false = queue is full... can then 
        // eliminate isEmpty() routine
        if (isEmpty(&self->idle_queue)) {
            return mp_const_none;
        } else {
            mp_obj_t buffer = dequeue(&self->idle_queue);
            return buffer;
        }
    } else { // RX
        // remove from active queue 
        // TODO change way of doing this ... try to remove with dequeue(), then test for true/false ...false = queue is full... can then 
        // eliminate isEmpty() routine
        if (isEmpty(&self->active_queue)) {
            return mp_const_none;
        } else {
            mp_obj_t buffer = dequeue(&self->active_queue);
            return buffer;  
        }
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_i2s_getbuffer_obj, machine_i2s_getbuffer);



STATIC mp_obj_t machine_i2s_putbuffer(mp_uint_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_buf };
    // TODO check that buffer size is multiple of 1/2 dma buffer size e.g  128 bytes
    
    // TODO check:  is buffer passed in one of the buffer supplied in the constructor?
    STATIC const mp_arg_t allowed_args[] = {
        { MP_QSTR_buf, MP_ARG_REQUIRED | MP_ARG_OBJ,  {.u_obj = mp_const_none} }, 
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(args), allowed_args, args);

    machine_i2s_obj_t *self = pos_args[0];

    if (!self->used) {
        mp_raise_ValueError(MP_ERROR_TEXT("I2S port is not initialized"));  // needed?
    }
    
    //if (self->mode != I2S_MODE_MASTER_TX) {
    //    mp_raise_ValueError(MP_ERROR_TEXT("I2S not configured for write method"));
    //}
    
    mp_buffer_info_t bufinfo;
    mp_get_buffer(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_WRITE);
    
    // For TX mode, add to active queue. For RX mode, add to inactive queue 
    if (self->mode == I2S_MODE_MASTER_TX) {
        // add buffer to queue 
        // TODO change way of doing this ... try to add with enqueue(), then test for true/false ...false = queue is full... can then 
        // eliminate isFull() routine
        if (isFull(&self->active_queue)) {
            mp_raise_ValueError(MP_ERROR_TEXT("Nogo - active queue is friggen full - end of the road bud"));
        }
        
        enqueue(&self->active_queue, args[ARG_buf].u_obj);
    } else { // RX
        // add buffer to queue 
        // TODO change way of doing this ... try to add with enqueue(), then test for true/false ...false = queue is full... can then 
        // eliminate isFull() routine
        if (isFull(&self->idle_queue)) {
            mp_raise_ValueError(MP_ERROR_TEXT("Nogo - inactive queue is friggen full - end of the road bud"));
        }
        
        // TODO likely memset the buffer to all 0s ?
        enqueue(&self->idle_queue, args[ARG_buf].u_obj);
    }

    return mp_const_none;  
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_i2s_putbuffer_obj, 2, machine_i2s_putbuffer);

STATIC mp_obj_t machine_i2s_start(mp_obj_t self_in) {  // TODO(?) self_in ---> self
    machine_i2s_obj_t *self = self_in;
    
    // TODO - add error checks ... for example, when this is called when no buffers exist in the queue
    // or:  has already been started and start() is called again
    // OR ... allow calling when no buffers exist and it's already running
    
    mp_buffer_info_t bufinfo;
    
    // TODO maybe do nothing is start() is called when it's already started?
    // - this could remove need to call isAvailable() in python code

#if 0
    if (isEmpty(&self->active_queue) && self->mode == I2S_MODE_MASTER_TX) {
        mp_raise_ValueError(MP_ERROR_TEXT("Nothing to transmit"));
        // TODO - might be OK to start and just send empty dma_buffer (TODO:  clear it first)
        // and then later have putbuffer fill it
    }
    
    if (isEmpty(&self->idle_queue) && self->mode == I2S_MODE_MASTER_RX) {
        mp_raise_ValueError(MP_ERROR_TEXT("No buffer for read"));
        // TODO - might be OK to start and just receive into empty dma_buffer
        // and then later have readinto empty it
    }
#endif
    
    // TODO seems to be a huge amount of coupling between queues and machine_i2s_feed_dma()
    if (self->mode == I2S_MODE_MASTER_TX) {
        mp_obj_t sample_buffer = dequeue(&self->active_queue);
        self->active_buffer = sample_buffer;
        mp_get_buffer(self->active_buffer, &bufinfo, MP_BUFFER_WRITE);
    } else {  // RX
        mp_obj_t sample_buffer = dequeue(&self->idle_queue);
        self->active_buffer = sample_buffer;
        mp_get_buffer(self->active_buffer, &bufinfo, MP_BUFFER_WRITE);
    }


    // start DMA.  DMA is configured to run continuously, using a circular buffer configuration
    uint16_t number_of_samples = 0;
    if (self->bits == I2S_DATAFORMAT_16B) {
        number_of_samples = SIZEOF_DMA_BUFFER_IN_BYTES / 2;
    } else {  // 32 bits
        number_of_samples = SIZEOF_DMA_BUFFER_IN_BYTES / 4;
    }
    HAL_StatusTypeDef status;

